{
    "ak47": "A gas-operated assault rifle commonly used in military conflicts, known for its reliability and distinctive curved magazine.",
    "american-flag": "The national flag of the United States, featuring 13 stripes and 50 stars symbolizing original colonies and current states.",
    "backpack": "A cloth or nylon bag worn on the back with shoulder straps, used to carry personal items or supplies.",
    "baseball-bat": "A smooth wooden or metal club used in baseball to hit the ball after it's pitched.",
    "baseball-glove": "Leather mitt worn on the hand to catch and field baseballs during gameplay.",
    "basketball-hoop": "A horizontal circular metal rim with a hanging net, mounted vertically for scoring in basketball.",
    "bat": "A nocturnal flying mammal with webbed wings that uses echolocation to navigate.",
    "bathtub": "A large container for holding water in which a person bathes, typically made of porcelain or acrylic.",
    "bear": "A large mammal with thick fur, a short tail, and strong limbs, found in various habitats worldwide.",
    "beer-mug": "A sturdy cylindrical glass or ceramic cup with a handle, specifically designed for serving beer.",
    "billiards": "A table game played with cues and balls, involving precise shots on a felt-covered surface with pockets.",
    "binoculars": "Dual telescopic lenses mounted side-by-side for magnified viewing of distant objects.",
    "birdbath": "A shallow basin filled with water, placed outdoors for birds to drink and bathe in.",
    "blimp": "A non-rigid airship without internal framework, using helium for buoyancy and propellers for movement.",
    "bonsai-101": "A miniature tree cultivated through precise pruning and training techniques in ornamental containers.",
    "boom-box": "A portable stereo system with built-in speakers, popular in the 1980s for playing cassette tapes.",
    "bowling-ball": "A heavy spherical ball with finger holes, designed to knock down pins in bowling alleys.",
    "bowling-pin": "A tall, narrow wooden or plastic target used in bowling, shaped like a bottle with a rounded top.",
    "boxing-glove": "Padded leather mitts worn by boxers to protect hands and reduce injury impact during matches.",
    "brain-101": "The central organ of the human nervous system, characterized by its folded gray matter and cognitive functions.",
    "breadmaker": "An electric kitchen appliance that automates the process of mixing, kneading, and baking bread.",
    "buddha-101": "A representation of Siddhartha Gautama, often depicted in meditative poses with serene facial features.",
    "bulldozer": "A heavy construction vehicle with a large metal blade in front for pushing earth and debris.",
    "butterfly": "A flying insect with colorful scaly wings, undergoing metamorphosis from caterpillar to winged adult.",
    "cactus": "A succulent plant adapted to arid environments, typically having spines and thick water-storing stems.",
    "cake": "A baked dessert made from flour, sugar, and eggs, often layered and decorated with frosting.",
    "calculator": "An electronic device with numerical buttons used for performing arithmetic calculations.",
    "camel": "A large desert-dwelling mammal with one or two humps that stores fat for sustenance.",
    "cannon": "A large-caliber gun mounted on wheels, historically used to launch projectiles in warfare.",
    "canoe": "A narrow open boat propelled by paddles, traditionally made from wood or modern synthetic materials.",
    "car-tire": "A rubber circular covering filled with air, mounted on wheel rims to provide vehicle traction.",
    "cartman": "A fictional animated character from South Park, known for his round shape and arrogant personality.",
    "cd": "A flat circular digital storage medium for music or data, read by lasers in optical drives.",
    "centipede": "A long arthropod with numerous leg-bearing segments, typically found in damp environments.",
    "cereal-box": "A rectangular cardboard container holding breakfast cereal, often featuring colorful branding.",
    "chandelier-101": "An ornate ceiling-mounted light fixture with multiple branches for holding bulbs or candles.",
    "chess-board": "A checkered game board with 64 squares arranged in an 8x8 grid for playing chess.",
    "chimp": "A highly intelligent primate with long arms, opposable thumbs, and expressive facial features.",
    "chopsticks": "Pair of slender tapered sticks used as traditional eating utensils in Asian cultures.",
    "cockroach": "A resilient insect with a flattened body and long antennae, often considered a pest.",
    "coffee-mug": "A cylindrical cup with a handle, typically made of ceramic, used for hot beverages like coffee.",
    "coffin": "A long rectangular box used to contain a deceased body for burial or cremation rituals.",
    "coin": "A small flat piece of metal minted with designs and values, used as legal tender.",
    "comet": "A celestial object consisting of ice and dust that develops a glowing tail when near the sun.",
    "computer-keyboard": "An input device with alphanumeric keys arranged in QWERTY layout for typing text.",
    "computer-monitor": "An electronic visual display screen that outputs information from a computer.",
    "computer-mouse": "A hand-held pointing device that detects motion to control a cursor on a screen.",
    "conch": "A tropical marine mollusk with a spiral shell, often used as a decorative object or horn.",
    "cormorant": "A diving seabird with dark plumage, a long neck, and a hooked bill for catching fish.",
    "covered-wagon": "A historical wooden wagon with canvas roof, used by pioneers for transportation.",
    "cowboy-hat": "A wide-brimmed high-crowned hat traditionally worn by ranch workers in North America.",
    "crab-101": "A crustacean with a broad carapace, stalked eyes, and pincers, found in coastal regions.",
    "desk-globe": "A spherical model of Earth mounted on a stand, showing geographical features and political boundaries.",
    "diamond-ring": "A jewelry piece featuring a cut diamond set in precious metal, often symbolizing engagement.",
    "dice": "Small cube with numbered sides (1-6) used in games of chance through random rolls.",
    "dog": "A domesticated carnivorous mammal with varied breeds, commonly kept as a pet.",
    "dolphin-101": "A highly intelligent marine mammal with a streamlined body and curved dorsal fin.",
    "doorknob": "A rounded handle attached to a door for opening and closing, typically made of metal or ceramic.",
    "drinking-straw": "A thin plastic or paper tube used to sip beverages from containers.",
    "duck": "A waterfowl with a broad bill, webbed feet, and waterproof feathers, found near ponds and lakes.",
    "dumb-bell": "A short bar with weighted ends, used for strength training and muscle building.",
    "eiffel-tower": "An iconic iron lattice tower in Paris, France, constructed as a landmark for the 1889 World's Fair.",
    "electric-guitar-101": "A stringed musical instrument that uses pickups to convert vibrations into electrical signals.",
    "elephant-101": "A large terrestrial mammal with a trunk, tusks, and ears, native to Africa and Asia.",
    "elk": "A large deer species with palmate antlers, found in North American and Eurasian forests.",
    "ewer-101": "A tall jug with a narrow spout, historically used for carrying and pouring water.",
    "eyeglasses": "Optical devices with corrective lenses mounted in frames, worn to improve vision.",
    "fern": "A non-flowering vascular plant with feathery fronds that reproduce via spores.",
    "fighter-jet": "A high-speed military aircraft designed for air-to-air combat and tactical bombing.",
    "fire-extinguisher": "A cylindrical device containing chemicals to spray onto fires for suppression.",
    "fire-hydrant": "A metal pipe connection providing pressurized water access for firefighting purposes.",
    "fire-truck": "A specialized vehicle equipped with pumps and hoses for extinguishing fires and rescue operations.",
    "fireworks": "Explosive pyrotechnic devices producing colored lights and loud noises for entertainment.",
    "flashlight": "A portable handheld electric light powered by batteries, used in dark environments.",
    "floppy-disk": "A square magnetic storage medium for digital data, now largely obsolete.",
    "football-helmet": "Protective headgear with a face mask, worn by players in American football.",
    "french-horn": "A brass musical instrument with coiled tubing and a flared bell, played with valves.",
    "fried-egg": "A chicken egg cooked in hot oil until the white solidifies and edges become crispy.",
    "frisbee": "A plastic disc thrown through the air for recreation or in competitive flying disc sports.",
    "frog": "An amphibian with smooth skin, long legs for jumping, and a lifecycle including tadpole stages.",
    "frying-pan": "A flat metal cooking utensil with a long handle, used for frying food over heat.",
    "galaxy": "A massive gravitationally bound system of stars, gas, and dark matter in space.",
    "gas-pump": "A machine at fuel stations that dispenses gasoline into vehicles through a nozzle.",
    "giraffe": "A tall African mammal with an elongated neck, patterned coat, and ossicones on its head.",
    "goat": "A horned ruminant mammal domesticated for milk, meat, and fiber production.",
    "golden-gate-bridge": "An iconic suspension bridge spanning the Golden Gate strait in San Francisco, California.",
    "goldfish": "A small freshwater fish often kept in aquariums, typically orange-gold in color.",
    "golf-ball": "A dimpled spherical ball used in golf, designed for aerodynamic flight when struck.",
    "goose": "A large waterfowl with a long neck, webbed feet, and migratory behavior in V-shaped formations.",
    "gorilla": "A large ground-dwelling primate with dark fur, native to African forests.",
    "grand-piano-101": "A large acoustic piano with horizontal strings and a lid that can be raised.",
    "grapes": "Small round fruits growing in clusters on vines, used fresh or fermented into wine.",
    "grasshopper": "A herbivorous insect with powerful hind legs for jumping and stridulating organs.",
    "guitar-pick": "A small flat tool used to pluck or strum guitar strings, typically made of plastic.",
    "hamburger": "A cooked ground meat patty served in a sliced bun, often with toppings and condiments.",
    "hammock": "A fabric or net slung between two points, used as a suspended bed or seat outdoors.",
    "harmonica": "A small rectangular wind instrument with metal reeds, played by blowing into holes.",
    "harp": "A large triangular stringed instrument played by plucking with fingers, common in classical music.",
    "harpsichord": "A historical keyboard instrument where strings are plucked rather than struck.",
    "hawksbill-101": "A critically endangered sea turtle with a distinctive patterned shell.",
    "head-phones": "A pair of cushioned speakers worn over the ears for private audio listening.",
    "helicopter-101": "A rotary-wing aircraft capable of vertical takeoff and hovering in place.",
    "hibiscus": "A tropical flowering plant with large colorful petals and prominent stamen.",
    "homer-simpson": "A fictional animated character from The Simpsons, known for his bald head and catchphrases.",
    "horse": "A domesticated hoofed mammal used for riding, racing, and agricultural work.",
    "horseshoe-crab": "A marine arthropod with a hard carapace and spike-like tail, resembling a horseshoe shape.",
    "hot-air-balloon": "A large fabric balloon filled with heated air, carrying passengers in an attached basket.",
    "hot-dog": "A grilled or steamed sausage served in a sliced bun, typically topped with condiments.",
    "hot-tub": "A large heated water container for recreational soaking, often with jets for hydrotherapy.",
    "hourglass": "A glass device with two connected bulbs, measuring time via sand flowing between them.",
    "house-fly": "A common flying insect with red compound eyes, known for spreading disease.",
    "human-skeleton": "The internal framework of bones supporting and protecting the human body.",
    "hummingbird": "A small bird capable of hovering flight, feeding on nectar with a long slender beak.",
    "ibis-101": "A long-legged wading bird with a curved bill, found in wetlands worldwide.",
    "ice-cream-cone": "A crisp edible cone-shaped wafer holding scoops of frozen dairy dessert.",
    "iguana": "A large tropical lizard with a row of spines along its back and a dewlap under the jaw.",
    "ipod": "A portable digital media player developed by Apple Inc., using flash memory storage.",
    "iris": "A flowering plant with showy petals, named after the Greek goddess of the rainbow.",
    "jesus-christ": "A central figure in Christianity, often depicted in art with long hair and robes.",
    "joy-stick": "An input device with a vertical lever, used to control video games or aircraft.",
    "kangaroo-101": "A marsupial with powerful hind legs for hopping and a pouch for carrying young.",
    "kayak": "A narrow one-person watercraft propelled by a double-bladed paddle.",
    "ketch-101": "A two-masted sailing vessel with fore-and-aft sails on both masts.",
    "killer-whale": "A large black-and-white predatory marine mammal, also called orca.",
    "knife": "A cutting tool with a sharp blade and handle, used for food preparation or combat.",
    "ladder": "A vertical or inclined set of rungs or steps for climbing between different heights.",
    "laptop-101": "A portable personal computer with a hinged screen and integrated keyboard.",
    "lathe": "A machine tool that rotates material against cutting tools to shape cylindrical objects.",
    "leopards-101": "A large spotted cat species with a muscular build and exceptional climbing ability.",
    "license-plate": "A metal or plastic plate displaying vehicle registration numbers and letters.",
    "lightbulb": "A glass enclosure with a filament that produces light when electrified.",
    "light-house": "A tall coastal tower with a bright lamp to guide ships and warn of hazards.",
    "lightning": "A natural electrical discharge between clouds or between clouds and the ground.",
    "llama-101": "A South American camelid with long neck and woolly coat, used as a pack animal.",
    "mailbox": "A receptacle for depositing outgoing mail and receiving incoming postal deliveries.",
    "mandolin": "A stringed musical instrument with a teardrop-shaped body and metal strings.",
    "mars": "The fourth planet from the Sun, known as the Red Planet due to iron oxide surface dust.",
    "mattress": "A large rectangular pad filled with materials like foam or springs, used for sleeping.",
    "megaphone": "A cone-shaped acoustic device used to amplify and direct the human voice.",
    "menorah-101": "A multi-branched candelabrum used in Jewish religious ceremonies.",
    "microscope": "An optical instrument with lenses for magnifying small objects invisible to the naked eye.",
    "microwave": "An electric oven that heats food by exposing it to microwave radiation.",
    "minaret": "A tall slender tower on a mosque, from which Muslims are called to prayer.",
    "minotaur": "A mythical creature with the head of a bull and body of a man from Greek mythology.",
    "motorbikes-101": "Two-wheeled motor vehicles with engines, designed for single or dual riders.",
    "mountain-bike": "A sturdy bicycle with thick treaded tires and multiple gears for off-road cycling.",
    "mushroom": "The spore-bearing fruiting body of fungi, often with a stem and umbrella-shaped cap.",
    "mussels": "Edible marine bivalve mollusks with dark oblong shells, often cooked in broth.",
    "necktie": "A long piece of cloth worn around the neck and tied in a knot under shirt collars.",
    "octopus": "A soft-bodied marine mollusk with eight arms and a bulbous head, capable of ink expulsion.",
    "ostrich": "A large flightless bird native to Africa, with long legs and neck for high-speed running.",
    "owl": "A nocturnal bird of prey with large forward-facing eyes and facial disk feathers.",
    "palm-pilot": "An early brand of personal digital assistant (PDA) with touchscreen and stylus input.",
    "palm-tree": "A tropical tree with unbranched trunk and large fan-like or feather-like leaves.",
    "paperclip": "A bent piece of wire used to hold sheets of paper together temporarily.",
    "paper-shredder": "A mechanical device with rotating blades for cutting paper into confetti-like strips.",
    "pci-card": "A hardware component inserted into a computer's motherboard to add functionality.",
    "penguin": "A flightless aquatic bird with black-and-white plumage, native to southern hemisphere.",
    "people": "Human beings depicted in images, varying in age, gender, and physical characteristics.",
    "pez-dispenser": "A novelty candy container that dispenses small pressed sweets through a head mechanism.",
    "photocopier": "A machine that makes paper copies of documents using xerographic technology.",
    "picnic-table": "An outdoor table with attached benches, typically made of wood or plastic.",
    "playing-card": "Rectangular pieces of cardstock printed with suits and ranks for various games.",
    "porcupine": "A rodent with sharp quills covering its body as defense against predators.",
    "pram": "A four-wheeled baby carriage with a hood, used for transporting infants.",
    "praying-mantis": "An insect with elongated front legs folded in prayer-like posture when hunting.",
    "pyramid": "A massive monumental structure with square base and triangular sides meeting at an apex.",
    "raccoon": "A nocturnal mammal with distinctive facial mask and ringed tail, found in North America.",
    "radio-telescope": "A large parabolic antenna used to detect radio waves from astronomical objects.",
    "rainbow": "A meteorological phenomenon caused by light reflection/refraction in water droplets.",
    "refrigerator": "An appliance that preserves food by maintaining a cool temperature via refrigeration.",
    "revolver-101": "A handgun with rotating cylinder holding multiple bullets that align with barrel.",
    "rifle": "A long-barreled firearm designed for accurate shooting, supported against the shoulder.",
    "rotary-phone": "A vintage telephone with a circular dial that must be rotated to input numbers.",
    "roulette-wheel": "A spinning gambling device with numbered pockets, used in casinos to determine bet outcomes.",
    "saddle": "A leather seat fastened on a horse's back for riding, featuring stirrups and a pommel.",
    "saturn": "The sixth planet from the Sun, recognized by its prominent system of concentric rings.",
    "school-bus": "A yellow-colored vehicle with flashing lights, designed to transport students to educational institutions.",
    "scorpion-101": "A venomous arachnid with segmented tail ending in a stinger, typically found in arid regions.",
    "screwdriver": "A hand tool with a flattened or cross-shaped tip, used to turn screws by applying rotational force.",
    "segway": "A two-wheeled self-balancing personal transporter controlled by shifting body weight.",
    "self-propelled-lawn-mower": "A grass-cutting machine with an internal engine that drives both blades and wheels.",
    "sextant": "A navigational instrument measuring angles between celestial objects and the horizon for maritime positioning.",
    "sheet-music": "Printed or handwritten notation displaying musical notes, lyrics, and rhythms for performers.",
    "skateboard": "A narrow board with four wheels, ridden by standing and pushing off the ground for momentum.",
    "skunk": "A black-and-white mammal that sprays foul-smelling liquid as a defense mechanism against predators.",
    "skyscraper": "An extremely tall habitable building with multiple floors, common in urban cityscapes.",
    "smokestack": "A tall industrial chimney releasing smoke and gases from combustion processes.",
    "snail": "A slow-moving mollusk with a coiled shell on its back, leaving a slime trail as it travels.",
    "snake": "A legless reptile with elongated body, scales, and often venomous fangs for subduing prey.",
    "sneaker": "A flexible rubber-soled athletic shoe designed for comfort during sports or casual wear.",
    "snowmobile": "A motorized vehicle with skis and tracks, built for traveling over snow-covered terrain.",
    "soccer-ball": "A spherical ball made of synthetic panels, used in the sport of association football.",
    "socks": "Knitted garments worn on the feet to absorb sweat and reduce friction with footwear.",
    "soda-can": "An aluminum container holding carbonated beverages, sealed with a pull-tab opener.",
    "spaghetti": "Long, thin cylindrical pasta strands, typically served with tomato sauce or meatballs.",
    "speed-boat": "A small watercraft with a powerful engine, built for rapid movement across water surfaces.",
    "spider": "An eight-legged arachnid that spins silk webs to trap insects for feeding.",
    "spoon": "A utensil with a shallow oval bowl and handle, used for eating liquid or soft foods.",
    "stained-glass": "Colored glass arranged in decorative patterns, often found in church windows or art panels.",
    "starfish-101": "A marine echinoderm with radial symmetry and tube feet, commonly found on ocean floors.",
    "steering-wheel": "A circular hand-operated device in vehicles that controls wheel direction for navigation.",
    "stirrups": "Metal foot supports hanging from a saddle, providing stability for horseback riders.",
    "sunflower-101": "A tall plant with a large yellow flower head that tracks the sun's movement.",
    "superman": "A fictional superhero clad in a blue-red cape, known for flight and superhuman strength.",
    "sushi": "A Japanese dish of vinegar-flavored rice combined with raw fish or vegetables, often wrapped in seaweed.",
    "swan": "An elegant waterbird with a long curved neck, pure white feathers, and graceful swimming posture.",
    "swiss-army-knife": "A compact multi-tool pocketknife with blades, screwdrivers, and other fold-out implements.",
    "sword": "A long-bladed metal weapon with a hilt, historically used for slashing or thrusting in combat.",
    "syringe": "A medical device with a needle and plunger, used to inject or withdraw fluids from the body.",
    "tambourine": "A percussion instrument with jingling metal disks set in a circular frame, shaken or struck.",
    "teapot": "A vessel with a spout, handle, and lid, designed for steeping and pouring hot tea.",
    "teddy-bear": "A soft stuffed toy bear named after President Theodore Roosevelt, symbolizing childhood comfort.",
    "teepee": "A conical tent traditionally made of animal skins, used by Indigenous peoples of the Great Plains.",
    "telephone-box": "A enclosed public payphone structure, often painted red in British contexts.",
    "tennis-ball": "A fuzzy fluorescent yellow sphere pressurized for consistent bounce during tennis matches.",
    "tennis-court": "A rectangular surface with marked lines and a net, used for playing tennis or related sports.",
    "tennis-racket": "An oval-framed strung tool with a handle, swung to hit tennis balls during gameplay.",
    "theodolite": "A precision optical instrument for measuring horizontal and vertical angles in surveying.",
    "toaster": "An electric appliance that browns bread slices by exposing them to heated metal coils.",
    "tomato": "A red edible fruit with juicy pulp, commonly used raw in salads or cooked in sauces.",
    "tombstone": "A carved stone marker placed at a gravesite, inscribed with the deceased's name and dates.",
    "top-hat": "A tall formal hat with a flat crown and narrow brim, associated with 19th-century elegance.",
    "touring-bike": "A bicycle designed for long-distance travel, equipped with racks and durable tires.",
    "tower-pisa": "A medieval bell tower in Italy famed for its unintended tilt due to unstable foundations.",
    "traffic-light": "A signaling device with red, yellow, and green lights to regulate vehicular flow at intersections.",
    "treadmill": "An exercise machine with a moving platform allowing users to walk or run in place.",
    "triceratops": "A herbivorous dinosaur with three facial horns and a large bony frill around its neck.",
    "tricycle": "A three-wheeled pedal vehicle, often used by young children learning motor coordination.",
    "trilobite-101": "An extinct marine arthropod with a segmented body, fossilized in ancient rock layers.",
    "tripod": "A three-legged stand providing stable support for cameras, telescopes, or laboratory equipment.",
    "t-shirt": "A short-sleeved casual cotton garment with a round neckline, worn on the upper body.",
    "tuning-fork": "A metal two-pronged instrument that vibrates at a specific pitch to calibrate musical tones.",
    "tweezer": "A small tool with two arms joined at one end, used to pluck hairs or pick up tiny objects.",
    "umbrella-101": "A folding canopy supported by ribs, providing rain protection when opened overhead.",
    "unicorn": "A mythical horse-like creature with a single spiraled horn projecting from its forehead.",
    "vcr": "A device that plays and records video on magnetic tape cassettes, prevalent in late 20th century.",
    "video-projector": "An electronic device projecting moving images onto a screen via lenses and light sources.",
    "washing-machine": "An appliance that cleans laundry by rotating clothes in soapy water and spin cycles.",
    "watch-101": "A wearable timepiece with a dial and hands (or digital display), worn on the wrist.",
    "waterfall": "A natural water flow descending steeply over a rocky cliff into a pool below.",
    "watermelon": "A large juicy fruit with green rind, pink flesh, and black seeds, eaten fresh in slices.",
    "welding-mask": "A protective face shield with dark visor to shield eyes from bright welding arcs.",
    "wheelbarrow": "A small cart with a single wheel and handles, used to transport heavy loads manually.",
    "windmill": "A structure with rotating blades that convert wind energy into mechanical power for grinding or pumping.",
    "wine-bottle": "A glass container with a narrow neck, corked to preserve fermented grape beverages.",
    "xylophone": "A musical percussion instrument with wooden bars struck by mallets to produce tones.",
    "yarmulke": "A small round brimless cap worn by Jewish males as a sign of reverence.",
    "yo-yo": "A toy consisting of two joined disks with a string looped around an axle, spun with hand motions.",
    "zebra": "An African wild horse with distinctive black-and-white striped coat patterns.",
    "airplanes-101": "Fixed-wing aircraft powered by jet engines or propellers, designed for aerial transportation.",
    "car-side-101": "The lateral view of an automobile, showcasing doors, windows, and body contours.",
    "faces-easy-101": "Frontal images of human faces with neutral expressions and uniform lighting conditions.",
    "greyhound": "A slender long-legged dog breed known for exceptional speed in sprinting.",
    "tennis-shoes": "Lightweight athletic footwear with rubber soles, designed for court sports like tennis.",
    "toad": "A warty-skinned amphibian with shorter legs than frogs, primarily terrestrial and nocturnal.",
    "clutter": "A miscellaneous assortment of objects scattered in disarray, lacking organization or purpose."
}