{
  "apple": "A round fruit with crisp flesh, typically red, green, or yellow skin, and seeds at the core.",
  "aquarium_fish": "Small colorful fish species bred for ornamental display in glass tanks with aquatic plants.",
  "baby": "A human infant in early developmental stages, characterized by small size and delicate features.",
  "bear": "A large mammal with thick fur, strong limbs, and omnivorous habits, found in diverse habitats globally.",
  "beaver": "A semiaquatic rodent with a flat tail and sharp teeth, known for building dams in rivers.",
  "bed": "A piece of furniture with a mattress and frame, designed for sleeping or resting.",
  "bee": "A flying insect with striped abdomen, known for pollinating flowers and producing honey.",
  "beetle": "A hard-shelled insect with wing cases, diverse in color and size across thousands of species.",
  "bicycle": "A two-wheeled human-powered vehicle with pedals, handlebars, and a frame for transportation.",
  "bottle": "A container with a narrow neck, typically made of glass or plastic, used for storing liquids.",
  "bowl": "A rounded dish with an open top, used for serving food or holding decorative items.",
  "boy": "A young male human child, often depicted with short hair and casual clothing.",
  "bridge": "A structure spanning a physical obstacle like water or a valley to connect two points.",
  "bus": "A large motor vehicle designed to transport passengers on fixed routes with multiple stops.",
  "butterfly": "A flying insect with large colorful wings, undergoing metamorphosis from a caterpillar.",
  "camel": "A desert-adapted mammal with humps storing fat, capable of surviving long periods without water.",
  "can": "A cylindrical metal container used for preserving food or beverages through sealing.",
  "castle": "A fortified medieval building with towers and thick walls, often associated with royalty.",
  "caterpillar": "The larval stage of butterflies and moths, with segmented bodies and multiple legs.",
  "cattle": "Domesticated bovine animals raised for milk, meat, or labor, including cows and bulls.",
  "chair": "A seat with a backrest and legs, designed for one person to sit on.",
  "chimpanzee": "A highly intelligent primate with long arms and expressive face, native to African forests.",
  "clock": "A timekeeping device with hands or digits, displaying hours, minutes, and seconds.",
  "cloud": "A visible mass of water droplets or ice crystals floating in the atmosphere.",
  "cockroach": "A resilient insect with flattened body, often considered a household pest.",
  "couch": "A long upholstered piece of furniture for seating multiple people, also called a sofa.",
  "crab": "A crustacean with a broad carapace, pincers, and legs adapted for sideways walking.",
  "crocodile": "A large aquatic reptile with powerful jaws, armored skin, and a long snout.",
  "cup": "A small open container with a handle, used for drinking beverages like tea or coffee.",
  "dinosaur": "An extinct reptile from the Mesozoic era, varying in size from small to colossal.",
  "dolphin": "A marine mammal with a streamlined body, known for intelligence and acrobatic leaps.",
  "elephant": "A massive terrestrial animal with a trunk, tusks, and large ears for thermoregulation.",
  "flatfish": "A type of marine fish with flattened body and both eyes on one side, like flounder.",
  "forest": "A dense ecosystem dominated by trees, supporting diverse plant and animal life.",
  "fox": "A carnivorous mammal with pointed ears, bushy tail, and reddish-brown fur.",
  "girl": "A young female human child, often depicted with varied hairstyles and clothing.",
  "hamster": "A small rodent with cheek pouches for storing food, commonly kept as a pet.",
  "house": "A building designed for human habitation, with rooms, windows, and a roof.",
  "kangaroo": "A marsupial with powerful hind legs for hopping and a pouch to carry young.",
  "keyboard": "An input device with rows of keys for typing characters on a computer or typewriter.",
  "lamp": "A lighting device with a bulb or shade, used to illuminate indoor or outdoor spaces.",
  "lawn_mower": "A machine with rotating blades to cut grass evenly in gardens or parks.",
  "leopard": "A large spotted cat with muscular build, known for climbing and stealthy hunting.",
  "lion": "A big cat with a tawny coat and males having a distinctive mane around the head.",
  "lizard": "A reptile with scaly skin, four legs, and a long tail, often found in warm climates.",
  "lobster": "A marine crustacean with large claws, a hard exoskeleton, and segmented body.",
  "man": "An adult male human, varying in appearance, clothing, and cultural context.",
  "maple_tree": "A deciduous tree with distinctive lobed leaves that turn vibrant colors in autumn.",
  "motorcycle": "A two-wheeled motorized vehicle with handlebars and an engine for acceleration.",
  "mountain": "A large natural elevation of the Earth's surface with steep slopes and rocky terrain.",
  "mouse": "A small rodent with a pointed snout, long tail, and often considered a household pest.",
  "mushroom": "The spore-bearing fruiting body of fungi, ranging from edible to poisonous varieties.",
  "oak_tree": "A long-lived tree with lobed leaves and acorns, symbolizing strength and endurance.",
  "orange": "A citrus fruit with bright orange peel, juicy segments, and high vitamin C content.",
  "orchid": "A flowering plant with complex, colorful blooms, often grown as ornamental specimens.",
  "otter": "A semiaquatic mammal with webbed feet and dense fur, known for playful behavior.",
  "palm_tree": "A tropical tree with a straight trunk and crown of large fan-like or feather-like leaves.",
  "pear": "A sweet fruit with a rounded bottom, tapering top, and soft, grainy flesh.",
  "pickup_truck": "A light-duty vehicle with an open cargo area, used for transporting goods.",
  "pine_tree": "An evergreen coniferous tree with needle-like leaves and woody cones.",
  "plain": "A broad expanse of flat or gently rolling land with few trees.",
  "plate": "A flat dish with a raised edge, used for serving or holding food during meals.",
  "poppy": "A flowering plant with vibrant petals and a seed pod, often symbolizing remembrance.",
  "porcupine": "A rodent with sharp quills covering its body as a defense mechanism.",
  "possum": "A nocturnal marsupial with a prehensile tail, known for 'playing dead' when threatened.",
  "rabbit": "A small mammal with long ears, soft fur, and strong hind legs for hopping.",
  "raccoon": "A nocturnal omnivore with a masked face and ringed tail, adapted to urban and wild habitats.",
  "ray": "A flattened marine fish with wing-like pectoral fins and a long, whip-like tail.",
  "road": "A paved or unpaved path for vehicles and pedestrians to travel between locations.",
  "rocket": "A cylindrical vehicle propelled by engines, designed for space exploration or missile use.",
  "rose": "A fragrant flowering shrub with thorny stems and layered petals in various colors.",
  "sea": "A vast body of saltwater covering most of Earth's surface, home to diverse marine life.",
  "seal": "A semi-aquatic marine mammal with streamlined body and flippers, often found in cold waters.",
  "shark": "A large predatory fish with cartilaginous skeleton and multiple rows of sharp teeth.",
  "shrew": "A tiny insectivorous mammal with a pointed snout and high metabolic rate.",
  "skunk": "A black-and-white mammal that sprays a foul-smelling liquid to deter predators.",
  "skyscraper": "An extremely tall building with multiple floors, dominating urban skylines.",
  "snail": "A slow-moving mollusk with a coiled shell, leaving a slimy trail as it travels.",
  "snake": "A legless reptile with elongated body, scales, and often venomous fangs.",
  "spider": "An eight-legged arachnid that spins silk webs to capture prey.",
  "squirrel": "A small tree-dwelling rodent with bushy tail and habit of hoarding nuts.",
  "streetcar": "An electric rail vehicle operating on tracks in urban areas for public transit.",
  "sunflower": "A tall plant with a large yellow flower head that follows the sun's movement.",
  "sweet_pepper": "A glossy, edible vegetable with hollow interior, available in green, red, or yellow varieties.",
  "table": "A piece of furniture with a flat top and legs, used for dining or placing objects.",
  "tank": "A heavily armored military vehicle with tracks and a rotating turret-mounted gun.",
  "telephone": "A communication device with a handset or keypad for transmitting voice over distances.",
  "television": "An electronic device with a screen for receiving broadcast signals and displaying programs.",
  "tiger": "A large striped big cat with orange fur and black markings, native to Asia.",
  "tractor": "A heavy vehicle with large rear wheels, used for agricultural tasks like plowing.",
  "train": "A connected series of rail cars propelled by a locomotive for transporting passengers or cargo.",
  "trout": "A freshwater fish with speckled skin, popular among anglers for sport and food.",
  "tulip": "A bulbous spring-blooming flower with cup-shaped petals in vibrant colors.",
  "turtle": "A reptile with a bony or cartilaginous shell, retractable head, and aquatic or terrestrial habits.",
  "wardrobe": "A tall cabinet with doors and shelves or hanging space for storing clothes.",
  "whale": "A gigantic marine mammal with streamlined body, blowhole, and filter-feeding or toothed varieties.",
  "willow_tree": "A tree with long drooping branches and narrow leaves, often growing near water.",
  "wolf": "A wild carnivorous mammal resembling a large dog, living and hunting in packs.",
  "woman": "An adult female human, varying in appearance, attire, and cultural representation.",
  "worm": "A limbless invertebrate with elongated soft body, found in soil or aquatic environments."
}