{
    "goldfish": "A small freshwater fish with vibrant orange-gold scales, commonly kept in aquariums.",
    "European fire salamander": "A black amphibian with bright yellow spots, found in European forests and known for toxic skin secretions.",
    "bullfrog": "A large frog with deep croaking calls, characterized by green or brown skin and aquatic habits.",
    "tailed frog": "A small frog with a tail-like extension, inhabiting cold streams in North America.",
    "American alligator": "A large reptilian predator with armored scales and powerful jaws, native to southeastern U.S. wetlands.",
    "boa constrictor": "A non-venomous snake that subdues prey by coiling around and suffocating it.",
    "trilobite": "An extinct marine arthropod with a segmented, three-lobed exoskeleton, fossilized in ancient rocks.",
    "scorpion": "A venomous arachnid with pincers and a segmented tail ending in a stinger.",
    "black widow": "A venomous spider with a shiny black body and a red hourglass marking on the abdomen.",
    "tarantula": "A large, hairy spider with mild venom, often kept as an exotic pet.",
    "centipede": "A fast-moving arthropod with elongated body and numerous leg-bearing segments.",
    "goose": "A waterfowl with a long neck, webbed feet, and honking calls, often migratory.",
    "koala": "A tree-dwelling marsupial with gray fur, known for eating eucalyptus leaves.",
    "jellyfish": "A gelatinous marine creature with trailing tentacles that deliver stings.",
    "brain coral": "A type of stony coral with a grooved surface resembling a human brain.",
    "snail": "A slow-moving mollusk with a coiled shell and slime trail.",
    "slug": "A shell-less terrestrial mollusk resembling a snail, often found in damp environments.",
    "sea slug": "A colorful marine mollusk with soft body and elaborate patterns, some species toxic.",
    "American lobster": "A large marine crustacean with claws, prized as seafood for its tender meat.",
    "spiny lobster": "A clawless lobster with long antennae and a spiny shell, found in warm waters.",
    "black stork": "A large wading bird with black plumage, red legs, and a long pointed beak.",
    "king penguin": "A tall Antarctic penguin with orange cheek patches and a sleek black-and-white body.",
    "albatross": "A seabird with the longest wingspan of any bird, gliding over oceans for hours.",
    "dugong": "A marine mammal with a rounded body and paddle-like flippers, feeding on seagrass.",
    "Chihuahua": "The smallest dog breed, known for its large eyes and energetic personality.",
    "Yorkshire terrier": "A small long-haired dog with a silky blue-and-tan coat, often kept as a companion.",
    "golden retriever": "A friendly, intelligent dog with a golden coat, bred for retrieving game.",
    "Labrador retriever": "A popular family dog with a short waterproof coat and outgoing demeanor.",
    "German shepherd": "A versatile working dog with a wolflike appearance and strong protective instincts.",
    "standard poodle": "An elegant, curly-coated dog known for intelligence and hypoallergenic fur.",
    "tabby": "A domestic cat with striped, spotted, or swirled fur patterns.",
    "Persian cat": "A long-haired cat breed with a flat face and luxurious coat.",
    "Egyptian cat": "A sleek short-haired cat often depicted in ancient Egyptian art.",
    "cougar": "A large wild cat with tawny fur, also known as a mountain lion or puma.",
    "lion": "A social big cat with males distinguished by a mane around the head.",
    "brown bear": "A large omnivorous bear with brown fur, found in forests and mountains.",
    "ladybug": "A small round beetle with red or orange wing covers and black spots.",
    "fly": "A winged insect with compound eyes, often associated with decaying matter.",
    "bee": "A pollinating insect with fuzzy body and striped abdomen, vital for ecosystems.",
    "grasshopper": "A jumping herbivore with powerful hind legs and camouflaged coloration.",
    "walking stick": "An insect resembling a twig or branch, using mimicry to evade predators.",
    "cockroach": "A resilient pest insect with flattened body and rapid movements.",
    "mantis": "A predatory insect with elongated front legs adapted for catching prey.",
    "dragonfly": "A fast-flying insect with iridescent wings and a slender body.",
    "monarch": "A migratory butterfly with orange-and-black wings, known for milkweed diet.",
    "sulphur butterfly": "A yellow butterfly with rounded wings, common in gardens and meadows.",
    "sea cucumber": "A cylindrical marine invertebrate with leathery skin, found on ocean floors.",
    "guinea pig": "A small domesticated rodent with a stocky body, often kept as a pet.",
    "hog": "A domesticated pig raised for meat, characterized by a stout body and snout.",
    "ox": "A large bovine trained as a draft animal, often with horns and muscular build.",
    "bison": "A massive herbivore with a shaggy mane, native to North American plains.",
    "bighorn": "A wild sheep with curved horns, adapted to rocky mountain habitats.",
    "gazelle": "A slender antelope with long legs and lyre-shaped horns, known for speed.",
    "Arabian camel": "A single-humped camel adapted to desert environments, also called a dromedary.",
    "orangutan": "A red-haired great ape with long arms, native to Southeast Asian rainforests.",
    "chimpanzee": "A highly intelligent primate with expressive face and complex social behaviors.",
    "baboon": "A ground-dwelling monkey with a dog-like snout and hierarchical troop structure.",
    "African elephant": "The largest land animal, with large ears and long tusks.",
    "lesser panda": "A small arboreal mammal with red fur and a bushy tail, also called a red panda.",
    "abacus": "An ancient calculating tool with beads sliding on rods, used for arithmetic.",
    "academic gown": "A formal robe worn by scholars during graduation ceremonies.",
    "altar": "A sacred table or platform used for religious rituals and offerings.",
    "apron": "A protective garment worn over clothing to shield against spills or stains.",
    "backpack": "A bag with shoulder straps for carrying items on one's back.",
    "bannister": "A handrail supported by posts, lining a staircase for safety.",
    "barbershop": "A establishment where hair is cut, styled, and groomed.",
    "barn": "A large farm building for storing crops, housing livestock, or sheltering equipment.",
    "barrel": "A cylindrical container with curved sides, often made of wood or metal.",
    "basketball": "An orange spherical ball with textured surface, used in the sport of basketball.",
    "bathtub": "A large container for holding water, designed for bathing.",
    "beach wagon": "A sturdy wheeled vehicle for transporting gear across sandy shores.",
    "beacon": "A visible or radio signal device guiding navigation or marking locations.",
    "beaker": "A cylindrical glass container with a lip, used in laboratories.",
    "beer bottle": "A glass container with a narrow neck, designed to hold beer.",
    "bikini": "A two-piece swimsuit consisting of a top and bottom, worn for swimming.",
    "binoculars": "Dual telescopic lenses mounted side-by-side for magnified viewing.",
    "birdhouse": "A small artificial shelter mounted outdoors to attract nesting birds.",
    "bow tie": "A necktie tied into a symmetrical bow shape, often formal attire.",
    "brass": "A metal alloy of copper and zinc, used for decorative or functional items.",
    "broom": "A cleaning tool with stiff fibers attached to a handle, used for sweeping.",
    "bucket": "A cylindrical container with a handle, used for carrying liquids or materials.",
    "bullet train": "A high-speed electric railway train operating on dedicated tracks.",
    "butcher shop": "A retail store specializing in fresh meat cuts and related products.",
    "candle": "A wax cylinder with an embedded wick, burned to produce light or fragrance.",
    "cannon": "A large-caliber gun historically used to launch projectiles.",
    "cardigan": "A knitted sweater opening at the front, typically with buttons.",
    "cash machine": "An electronic device dispensing cash and performing banking transactions.",
    "CD player": "A device that reads compact discs to play audio or data.",
    "chain": "A series of connected metal links used for securing, pulling, or decoration.",
    "chest": "A large sturdy box with a lid, used for storage or transport.",
    "Christmas stocking": "A long sock hung for festive gift-giving during Christmas traditions.",
    "cliff dwelling": "A human habitation built into the side of a cliff, often ancient.",
    "computer keyboard": "An input device with keys for typing text and commands into a computer.",
    "confectionery": "A shop or products related to sweets, candies, and sugary treats.",
    "convertible": "A car with a roof that can be folded down or removed.",
    "crane": "A machine with a hoist and cables, used to lift and move heavy objects.",
    "dam": "A barrier constructed to hold back water and create reservoirs.",
    "desk": "A piece of furniture with a flat surface for writing or working.",
    "dining table": "A table designed for meals, often surrounded by chairs.",
    "drumstick": "A stick used to strike drums or a term for cooked poultry legs.",
    "dumbbell": "A short bar with weighted ends, used for strength training.",
    "flagpole": "A tall pole from which a flag is hung and displayed.",
    "fountain": "A structure that jets water into the air for decorative or practical purposes.",
    "freight car": "A railroad car designed to transport cargo or goods.",
    "frying pan": "A flat metal pan with a long handle, used for frying food.",
    "fur coat": "A garment made from animal fur, worn for warmth and luxury.",
    "gasmask": "A protective mask covering the face to filter toxic gases or particles.",
    "go-kart": "A small four-wheeled vehicle used for recreational racing.",
    "gondola": "A flat-bottomed boat propelled by a pole, iconic to Venice's canals.",
    "hourglass": "A glass device measuring time via sand flowing between two bulbs.",
    "iPod": "A portable media player designed by Apple, popular in the 2000s.",
    "jinrikisha": "A human-pulled rickshaw used for transportation in historical Asia.",
    "kimono": "A traditional Japanese garment with wide sleeves and sash belt.",
    "lampshade": "A cover placed over a lamp to diffuse or direct light.",
    "lawn mower": "A machine with rotating blades to cut grass evenly.",
    "lifeboat": "A small boat carried on ships for emergency evacuation.",
    "limousine": "A luxury vehicle with extended seating and chauffeur service.",
    "magnetic compass": "A navigational tool using Earth's magnetic field to indicate direction.",
    "maypole": "A tall pole decorated with ribbons, used in festive dances.",
    "military uniform": "Standardized clothing worn by armed forces personnel.",
    "miniskirt": "A short skirt ending above the knees, popular in fashion.",
    "moving van": "A large truck used to transport household goods during relocation.",
    "nail": "A small metal pin with a flat head, used to join materials.",
    "neck brace": "A medical device supporting the neck during injury recovery.",
    "obelisk": "A tall stone pillar with a pyramidal top, often inscribed.",
    "oboe": "A woodwind instrument with a double reed and penetrating tone.",
    "organ": "A keyboard instrument with pipes or electronic tones.",
    "parking meter": "A device collecting payment for vehicle parking in urban areas.",
    "pay-phone": "A public telephone operated by coins or cards.",
    "picket fence": "A low fence with vertical wooden slats and pointed tops.",
    "pill bottle": "A small container for storing medication, often childproof.",
    "plunger": "A rubber suction cup on a stick, used to unclog drains.",
    "pole": "A long cylindrical object made of wood, metal, or other materials.",
    "police van": "A vehicle used by law enforcement to transport personnel or detainees.",
    "poncho": "A simple garment made of fabric with a neck opening, worn over the shoulders.",
    "pop bottle": "A plastic or glass container for carbonated beverages.",
    "potter's wheel": "A rotating platform used to shape clay into ceramic objects.",
    "projectile": "An object propelled through the air, such as a bullet or missile.",
    "punching bag": "A sturdy bag filled with material, used for boxing training.",
    "reel": "A cylindrical device for winding film, rope, or fishing line.",
    "refrigerator": "An appliance that cools and preserves food at low temperatures.",
    "remote control": "A handheld device for operating electronic equipment wirelessly.",
    "rocking chair": "A chair mounted on curved legs allowing a back-and-forth motion.",
    "rugby ball": "An oval-shaped ball used in the sport of rugby.",
    "sandal": "Open footwear with straps securing the sole to the foot.",
    "school bus": "A yellow vehicle transporting students to educational institutions.",
    "scoreboard": "A large display showing sports game scores and statistics.",
    "sewing machine": "A device stitching fabric with automated needle and thread.",
    "snorkel": "A breathing tube allowing swimmers to breathe while face-down in water.",
    "sock": "A knitted garment worn on the foot, providing comfort and warmth.",
    "sombrero": "A broad-brimmed Mexican hat, often brightly decorated.",
    "space heater": "A portable device generating heat for small indoor areas.",
    "spider web": "A structure of silken threads spun by spiders to catch prey.",
    "sports car": "A high-performance automobile designed for speed and agility.",
    "steel arch bridge": "A bridge supported by a curved steel framework.",
    "stopwatch": "A handheld timepiece for measuring precise intervals.",
    "sunglasses": "Tinted eyewear protecting eyes from sunlight and glare.",
    "suspension bridge": "A bridge hung from cables anchored to towers and piers.",
    "swimming trunks": "Garments worn by males for swimming, typically above the knee.",
    "syringe": "A medical device with a needle for injecting or withdrawing fluids.",
    "teapot": "A vessel with a spout, handle, and lid, used for brewing tea.",
    "teddy": "A stuffed toy bear, often associated with childhood comfort.",
    "thatch": "A roofing material made from dry vegetation like straw or reeds.",
    "torch": "A portable flame source or a battery-powered handheld light.",
    "tractor": "A heavy vehicle with large wheels, used for agricultural tasks.",
    "triumphal arch": "A monumental archway commemorating military victories.",
    "trolleybus": "An electric bus powered by overhead wires with trolley poles.",
    "turnstile": "A gate with rotating arms allowing controlled passage one person at a time.",
    "umbrella": "A collapsible canopy on a central rod, protecting from rain or sun.",
    "vestment": "Ceremonial robes worn by clergy during religious services.",
    "viaduct": "A long bridge-like structure carrying a road or railway over a valley.",
    "volleyball": "A spherical ball used in the sport of volleyball, typically white.",
    "water jug": "A large container with a handle and spout for holding and pouring water.",
    "water tower": "A tall structure holding a water tank to pressurize distribution systems.",
    "wok": "A round-bottomed cooking pan used in Asian cuisine for stir-frying.",
    "wooden spoon": "A utensil carved from wood, used for mixing or serving food.",
    "comic book": "A magazine featuring illustrated sequences of stories and dialogue.",
    "plate": "A flat dish with a raised edge, used for serving meals.",
    "guacamole": "A Mexican dip made from mashed avocados, lime, and seasonings.",
    "ice cream": "A frozen dessert made from dairy or plant-based ingredients, flavored and sweetened.",
    "ice lolly": "A flavored ice dessert on a stick, also called a popsicle.",
    "pretzel": "A baked pastry twisted into a knot, often salted.",
    "mashed potato": "Boiled potatoes crushed into a creamy consistency, typically seasoned.",
    "cauliflower": "A vegetable with a compact head of undeveloped white florets.",
    "bell pepper": "A hollow, mild-flavored vegetable available in green, red, or yellow.",
    "mushroom": "The spore-bearing fruiting body of fungi, edible or poisonous.",
    "orange": "A citrus fruit with juicy pulp and bright orange rind.",
    "lemon": "A yellow citrus fruit with sour juice, used in cooking and beverages.",
    "banana": "A tropical fruit with soft, sweet flesh and a yellow peel.",
    "pomegranate": "A fruit with tough red skin and juicy arils surrounding seeds.",
    "meat loaf": "A dish of ground meat mixed with seasonings and baked in a loaf shape.",
    "pizza": "A baked flatbread topped with tomato sauce, cheese, and various toppings.",
    "potpie": "A savory pie filled with meat and vegetables, covered with pastry.",
    "espresso": "A concentrated coffee brewed by forcing steam through finely-ground beans.",
    "alp": "A high mountain range or a single peak, often snow-capped.",
    "cliff": "A steep rock face formed by erosion or tectonic activity.",
    "coral reef": "An underwater ecosystem built by colonies of coral polyps.",
    "lakeside": "The land adjacent to a lake, often scenic and recreational.",
    "seashore": "The area where land meets the ocean, including beaches and tidal zones.",
    "acorn": "The nut of an oak tree, encased in a tough cupule."
}